{
    "home": {
        "playground": {
            "body": "Tous les projets personnels que je développe sont généralement ma façon de pratiquer une technologie précise que j'ai apprise. Ce site ne fait pas exception à la règle, car c’est le projet dans lequel je vais exercer mes compétences en React avec Typescript. Quelques exemples illustrant ceux-ci: le commutateur de thème clair/sombre qui passe au noir par défaut entre 19h et 5h, le commutateur de langue qui détecte évidemment votre langue (en utilisant l’anglais comme solution de secours) et cette carte même que vous lisez actuellement que vous allez sûrement rencontrer dans quelques endroits! Cela vaut la peine de savoir que ce site Web sera mon terrain de jeu principal pour essayer de nouvelles choses et que quelques fonctionalités peuvent apparaître à tout moment. Quelques choses peuvent aussi être en cours de développement, puisque je pousse régulièrement mon travail pour que vous puissiez voir le progrès du site!"
        },
        "sections": {
            "about": {
                "content": "Si vous ne me connaissez pas déjà, laissez-moi vous mettre à niveau! Je suis un Canadien de {{age}} ans originaire de Montréal et oui, nous avons du lait et des chips au ketchup et non, nous n'avons pas d'ours polaires qui errent par hasard dans nos rues! Je parle français et anglais (pas de chinois, mais je connais les gros mots!). <br /> <br /> Outre mon amour pour la programmation, je pratiquais divers arts martiaux de 8 à 16 ans: judo, aïkido et principalement du muay thaï. J'aime aussi jouer au golf pendant l'été et skier pendant notre hiver sans merci. Je sais aussi jouer de la guitare et préfère jouer « fingerstyle » plutôt que de gratter. En ce qui concerne le gaming, je préfère les mêmes vieux jeux FPS: jeux Call of Duty recyclés, jeux Battlefield pilotés par les DLC et les BRs imitateurs. Un jeu m'a marqué pour la vie cependant: Bioshock, en particulier Infinite. <br /> <br /> J'ai une dépendance étrange au chocolat, rien d’extraordinaire, un simple chocolat au lait alimente ma dépendance. J'aime les côtes, les ailes et les fajitas, ça doit être la sauce ou quelque chose comme ça! J'ai une grande faiblesse pour les massages, tout bon ami à moi sait qu'il peut me toucher le dos et m'envoyer dans une transe profonde. Je prends 2 crèmes et 1 sucre dans mon café et je préfère le café McDonald’s au café renommé de Tim Horton, peut-être parce que j’ai travaillé chez Tim pendant deux ans et demi…"
            },
            "youtube": {
                "content": "Quand j'avais 8 ans, j'ai créé une [chaîne YouTube](https://www.youtube.com/maxijonson). C'est là que j'ai construit mon nom. Croyez-le ou non, je voulais être chanteur à ce moment, ce qui est très loin du domaine des développeurs! <br /> <br /> Cette vocation n’a pas duré longtemps, j’ai rapidement trouvé une passion pour le montage vidéo. Vu que j’étais déjà dans le thème de la musique, j'ai mis mon chant quelque part de similaire en faisant des vidéos de paroles de chansons. Je voulais faire vivre les paroles, pas seulement afficher du texte statique à l'écran comme la plupart des autres vidéos du genre. C’est aussi à ce moment-là que j’ai eu mon premier grand succès avec la vidéo de «Heart Attack» de Demi Lovato. Malheureusement, une de ces vidéos a eu une atteinte au droits d'auteur, ce qui est un gros problème, car après trois atteintes, votre chaîne est bannie. Pour éviter tout risque supplémentaire, j’ai supprimé plus de 20 vidéos de paroles et ne conservais que les plus populaires qui étaient si anciennes que je ne craignais pas beaucoup de faire atteinte pour celles-ci. <br /> <br /> Après cela, ma chaîne est devenue à la fois une chaîne de jeux et une chaîne de design. J'avais des séries de jeux hebdomadaires et je réalisais des projets de conception tels que des intros vidéo et des typographies cinétiques. Pendant ce temps, j'ai beaucoup expérimenté avec After Effects, Photoshop et Cinema 4D. <br /> <br /> Plus tard, j’ai décroché mon premier emploi chez Tim Horton et ma chaîne s’est soudainement arrêtée, car je n’avais plus le temps de m’en occuper. En plus de cela, j'ai commencé à sentir que mes vidéos étaient en train de devenir une routine et non plus quelque chose que j'aimais autant qu'avant."
            }
        },
        "share": {
            "body": "Pour ceux qui sont intéressés, le code du site Web est sur [Github](https://github.com/maxijonson/Website) pour que vous puissiez vous y référer, peut-être apprendrez-vous une ou deux choses! Si vous n'êtes pas trop intéressé par la programmation, vous pouvez toujours suivre les plans du site Web sur [Trello](https://trello.com/b/9iho7pi4)!"
        },
        "welcome": {
            "body": "Bienvenue à cette 4e édition de mon site web! Le dernier était bâtit sur du code de base qui datent de mes débuts en programmation. J'ai voulu en refaire un depuis un moment, puisque j'ai acquis beaucoup de connaissances depuis, mais je n'ai jamais trouvé le temps, jusqu'à maintenant! Je suis vraiment fier d'avoir cette opportunité de mettre mes nouveaux talents au travail! Ce site est principalement un blog à props de moi et mon parcours, mais il est aussi un portfolio pour montrer mes travaux de programmation. Si vous êtes de Youtube, où le nom \"MaxiJonson\" est né, vous avez été des fans incroyables! Malheureusement, je n'avais plus le temps ni la motivation de faire des vidéos, j'espère que vous comprendrez!",
            "footer": "Note: MaxiJonson est mon alias en ligne. Mon vrai nom est Tristan Chin!"
        }
    }
}
