{
    "home": {
        "playground": {
            "body": "All the personnal projects I build are usually my way of practicing a precise technology I learned. This website is no exception, as it is the project in which I will be practicing my React skills with Typescript. A few examples demonstrating those: the light/dark theme switcher which switches to dark by default between 7PM and 5AM, the language switcher which obviously detects your language (using english as fallback) and this very card you're reading which you'll probably encounter in a couple of places! It is worth knowing that this website will be my main playground for trying out new stuff and some new feature may appear once in a while. Some things may also be still in development as I regularly \"push\" my work live so you can see the progress as it evolves!"
        },
        "sections": {
            "about": {
                "content": "If you don’t know me already, let me catch you up to speed! I am a {{age}} years old Canadian from Montreal and yes, we have bagged milk and ketchup chips and no, we don’t have polar bears just randomly roaming our streets! I speak both French and English (no Chinese, but I know the bad words!). <br /> <br /> Other than my love for programming, I also used to do a variety of martial arts from the age of 8 to 16: Judo, Aikido and mostly Muay Thai. I also enjoy golfing during the summer and skiing during our merciless winter. I also know how to play guitar and prefer playing fingerstyle over strumming. Gaming wise, I prefer same old FPS games: recycled Call of Duty games, DLC driven Battlefield games and copycats BRs. One game marked me for life though: Bioshock, particularly Infinite. <br /> <br /> I have some weird addiction to chocolate, nothing fancy, just plain milk chocolate fuels my addiction. I like ribs, wings and fajitas, must be the sauce or something! I have a huge weakness to massages, any good friend of mine knows that they can touch my back and send me into a deep trance. I take 2 creams and 1 sugar in my coffee and prefer McDonald’s coffee over Tim Horton’s renowned coffee, maybe because I worked at Timmies for two and a half years… "
            }
        },
        "share": {
            "body": "For the interested, the website's code is on [Github](https://github.com/maxijonson/Website) for you to use as reference, maybe you'll learn one thing or two! If you're not too much into programming, you can still follow the website's roadmap on [Trello](https://trello.com/b/9iho7pi4)!"
        },
        "welcome": {
            "body": "Welcome to the 4th edition of my website! The previous one was made on very basic code in my early programming days. I've been wanting to re-make it from scratch for a while, since I grew a lot in knowledge since then, but never found the time, until now! I'm very proud to have the opportunity to put my new skills to work! This website is mainly some kind of blog about me and my story, as well as a portfolio to showcase my programming works! If you're here from Youtube, where the name \"MaxiJonson\" was born, you guys were awesome followers! Unfortunately, I didn't have the time nor the motivation to make videos anymore, I hope you understand!",
            "footer": "Note: MaxiJonson is my online alias. My real name is Tristan Chin!"
        }
    }
}
