{
    "home": {
        "playground": {
            "body": "All the personnal projects I build are usually my way of practicing a precise technology I learned. This website is no exception, as it is the project in which I will be practicing my React skills with Typescript. A few examples demonstrating those: the light/dark theme switcher which switches to dark by default between 7PM and 5AM, the language switcher which obviously detects your language (using english as fallback) and this very card you're reading which you'll probably encounter in a couple of places! It is worth knowing that this website will be my main playground for trying out new stuff and some new feature may appear once in a while. Some things may also be still in development as I regularly \"push\" my work live so you can see the progress as it evolves!"
        },
        "share": {
            "body": "For the interested, the website's code is on [Github](https://github.com/maxijonson/Website) for you to use as reference, maybe you'll learn one thing or two! If you're not too much into programming, you can still follow the website's roadmap on [Trello](https://trello.com/b/9iho7pi4)!"
        },
        "welcome": {
            "body": "Welcome to the 4th edition of my website! The previous one was made on very basic code in my early programming days. I've been wanting to re-make it from scratch for a while, since I grew a lot in knowledge since then, but never found the time, until now! I'm very proud to have the opportunity to put my new skills to work! This website is mainly some kind of blog about me and my story, as well as a portfolio to showcase my programming works! If you're here from Youtube, where the name \"MaxiJonson\" was born, you guys were awesome followers! Unfortunately, I didn't have the time nor the motivation to make videos anymore, I hope you understand!",
            "footer": "Note: MaxiJonson is my online alias. My real name is Tristan Chin!"
        }
    }
}
