{
    "home": {
        "playground": {
            "body": "All the personnal projects I build are usually my way of practicing a precise technology I learned. This website is no exception, as it is the project in which I will be practicing my React skills with Typescript. A few examples demonstrating those: the light/dark theme switcher which switches to dark by default between 7PM and 5AM, the language switcher which obviously detects your language (using english as fallback) and this very card you're reading which you'll probably encounter in a couple of places! It is worth knowing that this website will be my main playground for trying out new stuff and some new feature may appear once in a while. Some things may also be still in development as I regularly \"push\" my work live so you can see the progress as it evolves! For the interested, the website's code is on [Github](https://github.com/maxijonson/Website) for you to use as reference, maybe you'll learn one thing or two! If you're not too much into programming, you can still follow the website's roadmap on [Trello](https://trello.com/b/9iho7pi4)!",
            "footer": "As of v4.4.0, the website's core has been moved to a NPM package: [tchin-react-components](https://www.npmjs.com/package/tchin-react-components)"
        },
        "sections": {
            "about": {
                "content": "If you don’t know me already, let me catch you up to speed! I am a {{age}} years old Canadian from Montreal and yes, we have bagged milk and ketchup chips and no, we don’t have polar bears just randomly roaming our streets! I speak both French and English (no Chinese, but I know the bad words!). <br /> <br /> Other than my love for programming, I also used to do a variety of martial arts from the age of 8 to 16: Judo, Aikido and mostly Muay Thai. I also enjoy golfing during the summer and skiing during our merciless winter. I also know how to play guitar and prefer playing fingerstyle over strumming. Gaming wise, I prefer same old FPS games: recycled Call of Duty games, DLC driven Battlefield games and copycats BRs. One game marked me for life though: Bioshock, particularly Infinite. <br /> <br /> I have some weird addiction to chocolate, nothing fancy, just plain milk chocolate fuels my addiction. I like ribs, wings and fajitas, must be the sauce or something! I have a huge weakness to massages, any good friend of mine knows that they can touch my back and send me into a deep trance. I take 2 creams and 1 sugar in my coffee and prefer McDonald’s coffee over Tim Horton’s renowned coffee, maybe because I worked at Timmies for two and a half years… "
            },
            "experience": {
                "intro": "Below, you’ll find a grid with the languages and technologies I know. They are also placed by knowledge level. **Basic** subjects are the ones that I’ve touched (most likely in school) but didn’t explore far enough to be comfortable with it without doing more research. **Intermediate** subjects are the ones that I’ve worked with for an extensive amount of time, enough to say I’m comfortable with making projects without worrying about blowing something up, but not enough to say I’m a guru! For **Advanced** subjects, I’ve worked with them for so long they’ve become a part of me. Usually, they are the ones that I’ve made a big project with, which allowed me to stumble on challenging situations you wouldn’t encounter in regular projects."
            },
            "programming": {
                "content": "I started having an interest in programming when I was in secondary 5 (which is the Quebec equivalent of grade 11). We had a web course, but it was extremely basic. We learned the basics of HTML with elements that are deprecated today (such as the &lt;center&gt; tag) and brushed CSS a bit. With just so little, I already had an interest in the matter and every project I would do would always have more than expected. In the final project, the teacher said she would give out extra points to people using even a single line of JavaScript and I remember thinking “what is that?”. Little did I know, those extra points (which I obviously got) were going to impact my future in so many ways, but not just yet… <br /> <br /> Secondary 5 was right before college. At the time, I had already applied for science on a path to medicine (classic Asian path). While studying science in college, I built my first website, which was awful and breaking so many coding conventions, but it was mine! After finishing my first semester, I realized science was not what I liked. I had perfect grades, but I hated it (especially chemistry). After taking some time to think about what I wanted to do, I realized I could do what I do as a hobby (coding) and make it a career! So, I applied in computer science, where my world was just about to get a whole lot bigger… <br /> <br /> Throughout my education, I always had an interest for web development. However, our program was not much web oriented, which is fine, but I wanted to learn advanced web stuff too. So, I started reading about JavaScript, web development in general and taking courses on [Udemy](https://www.udemy.com/). I could go on and on about my programming story, but this isn’t a book!"
            },
            "youtube": {
                "content": "When I was 8 years old, I started a [YouTube channel](https://www.youtube.com/maxijonson). This is where I built my name. Believe it or not, I wanted to be a singer at the moment, that’s way off the developer field! <br /> <br /> That vocation did not last long as I quickly found a passion in video editing. Since I was into music, I channeled my singing somewhere pretty close: making music lyrics videos. I wanted to make my lyrics live, not just display static text to the screen like most of them. It’s also at that moment that I got my first big hit with the Demi Lovato’s “Heart Attack” lyrics video. Unfortunately, one of those videos got a copyright strike, which is a big deal, since after 3 strikes, your channel gets banned. To avoid any more risks, I deleted over 20 lyrics videos and kept only the most popular ones that were so old I didn’t much fear about getting a strike for those. <br /><br />  After that, my channel became both a gaming channel and design channel. I had weekly gaming series and I was making design projects such as video intros and kinetic typography. During that time, I got to experience a lot with After Effects, Photoshop and Cinema 4D. <br /><br />  Later, I landed my first job at Tim Horton’s and my channel pretty much took a sudden stop since I had no more time for it. On top of it, I started to feel like my videos were becoming a routine and not something I enjoyed as much as I used to."
            }
        },
        "welcome": {
            "body": "Welcome to the 4th edition of my website! The previous one was made on very basic code in my early programming days. I've been wanting to re-make it from scratch for a while, since I grew a lot in knowledge since then, but never found the time, until now! I'm very proud to have the opportunity to put my new skills to work! This website is mainly some kind of blog about me and my story, as well as a portfolio to showcase my programming works! If you're here from Youtube, where the name \"MaxiJonson\" was born, you guys were awesome followers! Unfortunately, I didn't have the time nor the motivation to make videos anymore, I hope you understand!"
        }
    },
    "portfolio": {
        "projects": {
            "cuisto": {
                "description": {
                    "one": "Cuisto was a project as part of the end of my college program studies and was made with 3 of my friends. The idea was to make a solution for restaurants to manage everything that one needs to run. This included employees, inventory, suppliers, menu and more. It was also made with organizations in mind, meaning we wanted to offer support for a big organization, like a chain, to manage multiple entities it has.",
                    "three": "The project was split into two platforms: web and mobile (Android). The web part was mostly for management, while mobile was for in-restaurant use such as taking orders. In the beginning, the whole team was focused on the web. Shortly after, we split the team in 2: 2 for mobile, 2 for web. I was in charge of the back-end, made with Node.js (with Express), and met numerous challenges, especially authentication which cost me many hours of sleep! ",
                    "two": "Unfortunately, but with no surprise, one semester was not enough to deliver all we’ve wanted to make for this project. We were still surprised to see how far we went and plan to rebuild it on our own time, if possible. As the semester came close to an end, we had to improvise: cut down features like employee schedules and be a little less severe on code conventions. The final project was still beautiful, but there are many technicalities that we would’ve loved to spend time perfecting."
                }
            },
            "intellibot": {
                "description": {
                    "one": "Intellibot is one of my greatest achievements. Although it was made in Node.js, I didn’t even know what it was before I started this project. I don’t remember exactly how it started, but I know I was just scrolling through the internet and probably stumbled on a post about making Discord bots with JavaScript and that’s all I needed to get hooked.",
                    "three": "The bot wasn’t the most popular one, but it still kept an average of 35 servers during its early days when I was maintaining it. However, it was my first Node project, so the code was not the best. I later took a Node course before Cuisto, but Intellibot is just too much of a huge project to refactor. So, slowly, I stopped maintaining it to focus on sharpening my skills and maybe, one day, make a sibling bot.",
                    "two": "For a whole semester, on my own time, I sacrificed gaming to make this multipurpose bot. I wanted it to do everything most bots were doing, only in one single bot. This included music, server moderation, a score system, customizable settings and memes! Yes, memes! You could give it a template, which would be saved and at any time, you could make a meme with this template (top and bottom text). No watermarks, no meme generator websites, just one command to make dank content!"
                }
            },
            "poly": {
                "description": "As far as my memory goes, Poly Wallpaper was my first real JavaScript project. I discovered the language way before that of course, but in terms of project scale, it was the biggest at the time. If you don’t know what Wallpaper Engine is, it’s a software available on Steam that allows you to make custom wallpapers (more than just a static picture). This wallpaper reacts to the audio your computer makes, which looks great with music. Since it was pretty basic and I wanted to see how far I could go with it, I made a second version of it: React."
            },
            "punchbot": {
                "description": "PunchBot is probably one of my smallest projects. Because we had to log all of our hours on my college’s final project (Cuisto) including what we did, it quickly started to get tough to keep track of time. So, in less than 24 hours total, I made PunchBot, a Discord bot! It was a pretty simple project: punch in when you start, punch out when you’re done with a small message (like a commit message, for those familiar with Git). When the time came to make our weekly reports, a simple command would make a summary of everything, making it dead simple to keep track of our time. It also had mechanisms to remind you you’re punched in if you forget and even punches you out when it detects you’ve been working like a slave (12 hours straight)!"
            },
            "react": {
                "description": "No, not the JavaScript framework! In fact, I had no clue what React.js was at the time! It is basically a second version of Poly Wallpaper. This one added many features on top of the first version to improve its customizability. Going from colors, audio reactiveness, all the way to having a clock. With over 4000 subscribers, I am pretty proud of what I accomplished which such basic knowledge in JavaScript!"
            },
            "trc": {
                "description": "This NPM package was made shortly after the initial release of my website. After that release, I thought it would be a good idea to move some reusable logic into a separate NPM package so that I could import them easily in future React projects. Another nice perk of this package is that all its project dependencies are listed as dependencies instead of having some as dev-dependencies. Doing so, I can simply \"```npm i -S tchin-react-components```\" and I've got a good boilerplate to start a new project without having to worry about installing other dependencies!"
            },
            "website": {
                "description": {
                    "one": "So, you already know a bit about this website from the home page, but here’s a bit more extra I left out from the front page. The previous website was actually attacked! After researching many forms of website attacks and trying to place each one into mine, I finally found out that I may have been victim of an XSS attack (Google is your friend!). So, I deleted the home page, which fixed everything and proved my research was right!",
                    "three": "However, I believe I was just target practice. The website had nothing more than text. There was nothing sensitive that could’ve been stolen and there was barely any traffic. Nevertheless, this was an instructive moment and I’ve learned not to make the same mistakes!",
                    "two": "It wasn’t until a couple days later that I found out the home page wasn’t the only target. The hacker had installed a PHP backdoor into the server, which acted as a file manager for my entire server’s files. The funny part is I actually deleted the backdoor using the backdoor itself! Talk about using your opponent’s weapon against himself right!?"
                }
            }
        }
    }
}
