{
    "home": {
        "playground": {
            "body": "All the personnal projects I build are usually my way of practicing a precise technology I learned. This website is no exception, as it is the project in which I will be practicing my React skills with Typescript. A few examples demonstrating those: the light/dark theme switcher which switches to dark by default between 7PM and 5AM, the language switcher which obviously detects your language (using english as fallback) and this very card you're reading which you'll probably encounter in a couple of places! It is worth knowing that this website will be my main playground for trying out new stuff and some new feature may appear once in a while. Some things may also be still in development as I regularly \"push\" my work live so you can see the progress as it evolves!"
        },
        "sections": {
            "about": {
                "content": "If you don’t know me already, let me catch you up to speed! I am a {{age}} years old Canadian from Montreal and yes, we have bagged milk and ketchup chips and no, we don’t have polar bears just randomly roaming our streets! I speak both French and English (no Chinese, but I know the bad words!). <br /> <br /> Other than my love for programming, I also used to do a variety of martial arts from the age of 8 to 16: Judo, Aikido and mostly Muay Thai. I also enjoy golfing during the summer and skiing during our merciless winter. I also know how to play guitar and prefer playing fingerstyle over strumming. Gaming wise, I prefer same old FPS games: recycled Call of Duty games, DLC driven Battlefield games and copycats BRs. One game marked me for life though: Bioshock, particularly Infinite. <br /> <br /> I have some weird addiction to chocolate, nothing fancy, just plain milk chocolate fuels my addiction. I like ribs, wings and fajitas, must be the sauce or something! I have a huge weakness to massages, any good friend of mine knows that they can touch my back and send me into a deep trance. I take 2 creams and 1 sugar in my coffee and prefer McDonald’s coffee over Tim Horton’s renowned coffee, maybe because I worked at Timmies for two and a half years… "
            },
            "programming": {
                "content": "I started having an interest in programming when I was in secondary 5 (which is the Quebec equivalent of grade 11). We had a web course, but it was extremely basic. We learned the basics of HTML with elements that are deprecated today (such as the &lt;center&gt; tag) and brushed CSS a bit. With just so little, I already had an interest in the matter and every project I would do would always have more than expected. In the final project, the teacher said she would give out extra points to people using even a single line of JavaScript and I remember thinking “what is that?”. Little did I know, those extra points (which I obviously got) were going to impact my future in so many ways, but not just yet… <br /> <br /> Secondary 5 was right before college. At the time, I had already applied for science on a path to medicine (classic Asian path). While studying science in college, I built my first website, which was awful and breaking so many coding conventions, but it was mine! After finishing my first semester, I realized science was not what I liked. I had perfect grades, but I hated it (especially chemistry). After taking some time to think about what I wanted to do, I realized I could do what I do as a hobby (coding) and make it a career! So, I applied in computer science, where my world was just about to get a whole lot bigger… <br /> <br /> Throughout my education, I always had an interest for web development. However, our program was not much web oriented, which is fine, but I wanted to learn advanced web stuff too. So, I started reading about JavaScript, web development in general and taking courses on [Udemy](https://www.udemy.com/). I could go on and on about my programming story, but this isn’t a book!"
            },
            "youtube": {
                "content": "When I was 8 years old, I started a [YouTube channel](https://www.youtube.com/maxijonson). This is where I built my name. Believe it or not, I wanted to be a singer at the moment, that’s way off the developer field! <br /> <br /> That vocation did not last long as I quickly found a passion in video editing. Since I was into music, I channeled my singing somewhere pretty close: making music lyrics videos. I wanted to make my lyrics live, not just display static text to the screen like most of them. It’s also at that moment that I got my first big hit with the Demi Lovato’s “Heart Attack” lyrics video. Unfortunately, one of those videos got a copyright strike, which is a big deal, since after 3 strikes, your channel gets banned. To avoid any more risks, I deleted over 20 lyrics videos and kept only the most popular ones that were so old I didn’t much fear about getting a strike for those. <br /><br />  After that, my channel became both a gaming channel and design channel. I had weekly gaming series and I was making design projects such as video intros and kinetic typography. During that time, I got to experience a lot with After Effects, Photoshop and Cinema 4D. <br /><br />  Later, I landed my first job at Tim Horton’s and my channel pretty much took a sudden stop since I had no more time for it. On top of it, I started to feel like my videos were becoming a routine and not something I enjoyed as much as I used to."
            }
        },
        "share": {
            "body": "For the interested, the website's code is on [Github](https://github.com/maxijonson/Website) for you to use as reference, maybe you'll learn one thing or two! If you're not too much into programming, you can still follow the website's roadmap on [Trello](https://trello.com/b/9iho7pi4)!"
        },
        "welcome": {
            "body": "Welcome to the 4th edition of my website! The previous one was made on very basic code in my early programming days. I've been wanting to re-make it from scratch for a while, since I grew a lot in knowledge since then, but never found the time, until now! I'm very proud to have the opportunity to put my new skills to work! This website is mainly some kind of blog about me and my story, as well as a portfolio to showcase my programming works! If you're here from Youtube, where the name \"MaxiJonson\" was born, you guys were awesome followers! Unfortunately, I didn't have the time nor the motivation to make videos anymore, I hope you understand!",
            "footer": "Note: MaxiJonson is my online alias. My real name is Tristan Chin!"
        }
    }
}
